DataProcessors/ПечатьТерможурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПечатьТерможурнала</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ЗагрузкаКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗагрузкаКамеры</Name>
			<BasedOn>
				<xr:Item>Document.НачалоТермообработки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КамераТермообработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КамерыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНеоконченыеПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогРамПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоТермообработки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПечатьТерможурнала/Forms/ФормаУФ/Ext/Form/Module.bsl
// Модуль формы обработки ПечатьТерможурнала
// Логика перенесена из формы обработки УМК_ПечатьТерможурнала (1С77). // + claude

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Аналог ПриОткрытии() 1С77: если передан список документов — печатаем и закрываемся
	Если Параметры.Свойство("СписокДокументов") Тогда
		Для Каждого Документ Из Параметры.СписокДокументов Цикл
			НоваяСтрока          = Загрузки.Добавить();
			НоваяСтрока.Документ = Документ;
		КонецЦикла; // по переданным документам
		АвтоПечать = Загрузки.Количество() > 0;
	КонецЕсли; // передан список документов

КонецПроцедуры // ПриСозданииНаСервере // + claude

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Аналог 1С77: при открытии со списком-параметром — печать и выход
	Если АвтоПечать Тогда
		НапечататьЖурналы();
		Отказ = Истина; // форма не открывается — аналог СтатусВозврата(0) в 1С77
	КонецЕсли; // автопечать по параметру

КонецПроцедуры // ПриОткрытии // + claude

// Команда заполнения списка загрузок за период
&НаКлиенте
Процедура ЗаполнитьЗаПериод(Команда)

	Если НЕ ЗначениеЗаполнено(НачДата) Или НЕ ЗначениеЗаполнено(КонДата) Тогда
		Сообщить("Не задан период!");
		Возврат;
	КонецЕсли; // период не задан

	ЗаполнитьЗаПериодНаСервере();

КонецПроцедуры // ЗаполнитьЗаПериод // + claude

&НаСервере
Процедура ЗаполнитьЗаПериодНаСервере()

	// Перенос ЗаполнитьЗагрузкамиЗаПериод() из 1С77; отбор по камере и
	// подпрограмме включен (в 1С77 условия были заготовлены комментарием)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагрузкаКамеры.Ссылка КАК Документ
		|ИЗ
		|	Документ.ЗагрузкаКамеры КАК ЗагрузкаКамеры
		|ГДЕ
		|	ЗагрузкаКамеры.Дата МЕЖДУ &НачДата И &КонДата
		|	И НЕ ЗагрузкаКамеры.ПометкаУдаления
		|	И (НЕ &ОтборПоКамере ИЛИ ЗагрузкаКамеры.КамераТермообработки = &Термокамера)
		|	И (НЕ &ОтборПоПодпрограмме ИЛИ ЗагрузкаКамеры.ПодПрограмма = &Подпрограмма)
		|УПОРЯДОЧИТЬ ПО
		|	ЗагрузкаКамеры.Дата";
	Запрос.УстановитьПараметр("НачДата", НачалоДня(НачДата));
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонДата));
	Запрос.УстановитьПараметр("ОтборПоКамере", ЗначениеЗаполнено(Термокамера));
	Запрос.УстановитьПараметр("Термокамера", Термокамера);
	Запрос.УстановитьПараметр("ОтборПоПодпрограмме", ЗначениеЗаполнено(Подпрограмма));
	Запрос.УстановитьПараметр("Подпрограмма", Подпрограмма);

	Загрузки.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока          = Загрузки.Добавить();
		НоваяСтрока.Документ = Выборка.Документ;
	КонецЦикла; // по выборке документов

КонецПроцедуры // ЗаполнитьЗаПериодНаСервере // + claude

// Команда формирования терможурналов по документам списка
&НаКлиенте
Процедура Сформировать(Команда)

	Если Загрузки.Количество() = 0 Тогда
		Сообщить("Список загрузок камеры пуст!");
		Возврат;
	КонецЕсли; // пустой список

	НапечататьЖурналы();

КонецПроцедуры // Сформировать // + claude

// Формирует и показывает терможурнал по каждому документу списка (аналог Сформировать() 1С77)
&НаКлиенте
Процедура НапечататьЖурналы()

	МассивТабДок = СформироватьНаСервере();
	Для Каждого Печать Из МассивТабДок Цикл
		УниверсальныеМеханизмы.НапечататьДокумент(Печать.ТабДокумент, 1, Ложь, "Терможурнал", Печать.Документ);
	КонецЦикла; // по сформированным документам

КонецПроцедуры // НапечататьЖурналы // + claude

&НаСервере
Функция СформироватьНаСервере()

	МассивТабДок = Новый Массив;
	Для Каждого СтрокаЗагрузки Из Загрузки Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Документ) Тогда
			Продолжить;
		КонецЕсли; // пустая строка списка

		ТабДокумент = Обработки.ПечатьТерможурнала.СформироватьТерможурнал(СтрокаЗагрузки.Документ);
		МассивТабДок.Добавить(Новый Структура("ТабДокумент, Документ", ТабДокумент, СтрокаЗагрузки.Документ));

	КонецЦикла; // по строкам списка загрузок

	Возврат МассивТабДок;

КонецФункции // СформироватьНаСервере // + claude
